[
  {
    "title": {
      "en": "Ecla Programming Language",
      "fr": "Langage de Programmation Ecla"
    },
    "description": {
      "en": "Ecla is a user‑friendly programming language I helped build from the ground up. The repository holds the source code, documentation, and tools for the Ecla 1.0.0 release.",
      "fr": "Ecla est un langage de programmation facile à prendre en main que j'ai contribué à créer depuis le début. Le dépôt comprend le code source, la documentation et les outils pour la version 1.0.0."
    },
    "link": "https://github.com/Eclalang/Ecla"
  },
  {
    "title": {
      "en": "Hello‑World",
      "fr": "Hello‑World"
    },
    "description": {
      "en": "A comprehensive collection of \"Hello World\" examples in many programming languages—ideal for learning language basics and syntax comparisons.",
      "fr": "Une collection complète d'exemples \"Hello World\" dans de nombreux langages de programmation—idéal pour apprendre les bases et comparer les syntaxes."
    },
    "link": "https://github.com/tot0p/Hello-World"
  },
  {
    "title": {
      "en": "ColorHit",
      "fr": "ColorHit"
    },
    "description": {
      "en": "A short 2D shooter made during One Minute Game Jam #5. You control a tank that shoots paintballs or moves across the map to color the world.",
      "fr": "Un petit shooter 2D créé pour la One Minute Game Jam #5. Vous contrôlez un tank qui tire des billes de peinture ou se déplace sur la carte pour colorier le monde."
    },
    "link": "https://github.com/tot0p/ColorHit"
  },
  {
    "title": {
      "en": "GoBoy - GameBoy Emulator",
      "fr": "GoBoy - Émulateur GameBoy"
    },
    "description": {
      "en": "GoBoy is a multi‑platform GameBoy and GameBoy Color emulator written in Go. It runs the majority of GB and some CGB games, includes color & sound support, and offers console debugging tools.",
      "fr": "GoBoy est un émulateur multiplate‑forme GameBoy et GameBoy Color écrit en Go. Il exécute la majorité des jeux GB et certains CGB, avec support couleurs & son, et propose des outils de debug console."
    },
    "link": "https://github.com/Let-sCodeSomething/goboy"
  },
  {
    "title": {
      "en": "Space-ship-shooting",
      "fr": "Space-ship-shooting"
    },
    "description": {
      "en": "A shoot‑'em‑up coded in JavaScript over one month using p5.js, p5.play, p5.sound and p5.clickable—piloting a spaceship to shoot enemies and survive.",
      "fr": "Un shoot‑'em‑up codé en JavaScript pendant un mois avec p5.js, p5.play, p5.sound et p5.clickable ; vous pilotez un vaisseau spatial pour tirer sur les ennemis et survivre."
    },
    "link": "https://github.com/tot0p/Space-ship-shooting"
  }
]
